Xinyuan-LilyGO/T-Halow-P4/examples/camera_display/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
//CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_model.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y


CONFIG_FATFS_LFN_HEAP=y

CONFIG_IDF_EXPERIMENTAL_FEATURES=y

CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y

# CONFIG_CAMERA_SC2336=y
# CONFIG_CAMERA_SC2336_CUSTOMIZED_IPA_JSON_CONFIGURATION_FILE=y
# CONFIG_CAMERA_SC2336_CUSTOMIZED_IPA_JSON_CONFIGURATION_FILE_PATH="components/private_library/sc2336_ipa_config.json"
# CONFIG_CAMERA_SC2336_MIPI_RAW10_1280x720_30FPS=y

CONFIG_CAMERA_OV2710=y
CONFIG_CAMERA_OV2710_CUSTOMIZED_IPA_JSON_CONFIGURATION_FILE=y
CONFIG_CAMERA_OV2710_CUSTOMIZED_IPA_JSON_CONFIGURATION_FILE_PATH="components/private_library/ov2710_ipa_config.json"
CONFIG_CAMERA_OV2710_MIPI_RAW10_1280X720_25FPS=y

# CONFIG_CAMERA_OV5645=y
# CONFIG_CAMERA_OV5645_MIPI_RGB565_1280X960_30FPS=y

CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=8192
